{
  "content": "<p>AI Overviews kill clicks. It’s a fact.</p><p>&nbsp;</p><p>The interesting part is that this affects both organic and paid traffic.<br>Even more intriguing... CTRs decrease even for queries that don't trigger AIO.</p><p>&nbsp;</p><p>This report by Seer Interactive is extremely telling.</p><p>&nbsp;</p><p>The \"zero-click\" trend has been accelerated by AI Overviews and chatbots, but it existed long before them.</p><p>&nbsp;</p><p>Google has been developing a \"zero-click\" strategy for at least the past decade. Think of Knowledge Panels, Google Business Profiles, FAQ snippets etc.</p><p>&nbsp;</p><p>But also,<br>Google Hotels, Google Flights, and even Google Shopping.</p><p>&nbsp;</p><p>They all aim to keep users on Google as long as possible, absorbing steps of the consumer journey that used to belong to publishers and merchants.</p><p>&nbsp;</p><p>But the irony is clear.</p><p>&nbsp;</p><p>Google disrupted the industry in the late 90s by inventing a clean, fast search engine built to send users to the best result as quickly as possible.</p><p>&nbsp;</p><p>This was unlike Yahoo, for example, which aimed to keep users on-site to sell more display ad impressions.</p><p>&nbsp;</p><p>The same now applies to social networks.<br>None of them want users to click away.</p><p>&nbsp;</p><p>Today, the \"death of clicks\" has massive repercussions for digital marketing:<br>how can we track user journeys across platforms if they never click?</p><p>&nbsp;</p><p>Sure, we could use impressions or view tracking, but let's be real. That has never truly worked.</p><p>&nbsp;</p><p>So, what to do?</p><p>&nbsp;</p><p>Measurement techniques like incrementality experiments and Marketing Mix Modeling (MMM) are thriving because they don't rely on clicks.</p><p>&nbsp;</p><p>But generally, we need to realise that:</p><p>&nbsp;</p><p>clicks ≠ business</p><p>&nbsp;</p><p>Digital marketing must steer away from clicks and tracking and refocus on \"old-school\" concepts like share of voice, brand awareness etc</p><p>&nbsp;</p><p>and ultimately, surprise surprise, revenue!</p><p>&nbsp;</p><p>It’s a mindset shift.<br>Not everybody likes it, but it is necessary.</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:share:7399425508951887872",
  "published_at": "2025-11-26T16:15:05.815000",
  "images": [
    {
      "url": "https://raw.githubusercontent.com/GiacomoIono/linkedin-posts-clean/refs/heads/main/images/2025-11-26.jpg",
      "alt": ""
    }
  ]
}