{
  "content": "<p>Are you drowning in the AI-video tools jungle? Me too!</p><p>&nbsp;</p><p>But watch this. It might be the best 7 minutes of your week.</p><p>&nbsp;</p><p>There’s a flood of AI video tools out there.<br>Which ones actually work? How to choose?</p><p>&nbsp;</p><p>The Wall Street Journal did the hard work for us.</p><p>&nbsp;</p><p>Here’s the exact stack they used to produce this short film:</p><p>&nbsp;</p><p>▸ Midjourney, for character creation.<br>▸ Runway Act-One, to animate characters with real-life gestures.<br>▸ Runway References, to maintain visual consistency across scenes.<br>▸ Google Veo 2, for basic image animations.<br>▸ Google Veo 3, for enhanced animations and background sounds.<br>▸ Suno, for background music.<br>▸ ElevenLabs, for the robot's voice and the lady's voiceover.<br>▸ Any video editor to stitch it all together.</p><p>&nbsp;</p><p>The result is impressive, but not jaw dropping.<br>Because it's made with consumer Ai tools only, hence not perfect.</p><p>&nbsp;</p><p>But the point is that anybody can achieve similar results by using the exact same tools.</p><p>&nbsp;</p><p>The reality is that many of the amazing Ai videos we see online are actually heavily edited by (semi)professional video makers using professional tools.</p><p>&nbsp;</p><p>This is not the case and I love it.</p><p>&nbsp;</p><p>They even share the final cost, around $1'000. Very realistic.</p><p>&nbsp;</p><p>One element is still missing: lip-syncing.</p><p>&nbsp;</p><p>Getting it right is still the hardest challenge. No wonder they didn't include it in this video.<br>But you can try Runway’s Lip-Sync tool, it gets fairly close.</p><p>&nbsp;</p><p>Otherwise, Google Veo 3 can make characters talk in perfect lip-synch, but not with uploaded original audio.</p><p>&nbsp;</p><p>Right now, the combo of Runway + Veo 2/3 might just be the most powerful AI video stack out there.</p><p>&nbsp;</p><p>And remember,<br>this is the worst quality we’ll ever see. It only gets better from here.</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:ugcPost:7336090161090359297",
  "published_at": "2025-06-05T08:30:27.363000",
  "images": [
    {
      "url": "https://raw.githubusercontent.com/GiacomoIono/linkedin-posts-clean/refs/heads/main/images/2025-06-05.jpg",
      "alt": ""
    }
  ]
}