{
  "content": "<p>AI chatbots will become streaming platforms.</p><p>&nbsp;</p><p>No, they will not stream movies.<br>They will stream content.</p><p>&nbsp;</p><p>Just like Netflix licenses exclusives, AI platforms will sign exclusive deals with media companies and creators.</p><p>&nbsp;</p><p>You’ll subscribe to:</p><p>&nbsp;</p><p>ChatGPT for Financial Times exclusives.<br>Claude for The Verge.<br>Perplexity for Wired.<br>and so on…</p><p>&nbsp;</p><p>Because original, high-quality content is still the backbone of the internet.</p><p>&nbsp;</p><p>But right now, that backbone is cracking.</p><p>&nbsp;</p><p>Media companies and creators are discouraged from producing premium content, because many AI models scrape it without permission, remix it poorly, and never send traffic back.</p><p>&nbsp;</p><p>It’s extractive and short-sighted. It cannot last.</p><p>&nbsp;</p><p>But AI platforms still need fresh, original content to stay relevant and competitive.</p><p>&nbsp;</p><p><br>So what’s next?<br>Three possible scenarios:</p><p>&nbsp;</p><p><br>1️⃣ Content-heavy websites will charge for crawling.<br>Until now they let Google do it for free, because it sent traffic back.<br>But AI doesn’t :(<br>Ai chatbots crawl websites 10 times more often than Google used to do at its peak years before AI. <br>For website owners enough is enough.<br>You crawl, you pay.</p><p>&nbsp;</p><p>2️⃣ More exclusive licensing deals.</p><p>&nbsp;</p><p>3️⃣ A hybrid of the two:<br>Big players go exclusive. Smaller creators charge per crawl.</p><p>&nbsp;</p><p><br>Users will notice differences.<br>Chatbots will sound distinct depending on what content they’re trained on.</p><p>&nbsp;</p><p>To the point that niche specialised chatbots will arise.</p><p>&nbsp;</p><p>Think of an AI skiing assistant trained on every ski publication, gear review blog, resorts website etc. <br>It will know more about skiing than any other chatbot!</p><p>&nbsp;</p><p><br>Honestly, this wouldn’t be a bad future for the internet! <br>Some reasons to be optimistic this Monday morning ☺️ </p><p>&nbsp;</p><p>Have a good week everyone!</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:share:7332504549519233027",
  "published_at": "2025-05-26T08:30:08.461000",
  "images": []
}