{
  "content": "<p>Want more money?</p><p>&nbsp;</p><p>Switch job.</p><p>&nbsp;</p><p>Old story. Everybody knows it.</p><p>&nbsp;</p><p>But it’s not just about higher wages.</p><p>&nbsp;</p><p>👉 It’s about pace of innovation.</p><p>&nbsp;</p><p>New hires bring new ideas.<br>Sometimes they disrupt decade-old processes.</p><p>&nbsp;</p><p>Frequent reshuffle forces innovation.</p><p>&nbsp;</p><p>The US is leading this trend, while Italy is a negative outlier.</p><p>&nbsp;</p><p>Many elements explain this gap.</p><p>&nbsp;</p><p>But the best companies even in the US retain people for the long run.</p><p>&nbsp;</p><p>Think of Doug McMillon, who went from summer intern to Walmart CEO in over 30 years at the company!</p><p>&nbsp;</p><p>As always, the best soup is the one with just the right temperature.</p><p>&nbsp;</p><p>Between hopping jobs every year and staying 20+ years, there’s a massive in-between that companies should encourage.</p><p>&nbsp;</p><p>Especially now. In the age of AI.</p><p>&nbsp;</p><p>Companies must accept to be disrupted from the inside, by their own people, rather than waiting for outsiders.</p><p>&nbsp;</p><p>Great companies attract talents who bring great ideas. Day one. Year five. Year ten.</p><p>&nbsp;</p><p>But they must listen. And trust.</p><p>&nbsp;</p><p>If not, those ideas will go elsewhere.<br>And so will the money.</p><p>&nbsp;</p><p>Big Tech nailed this.<br>It’s not unusual to see employees staying 10+ years while still driving crazy innovation.</p><p>&nbsp;</p><p>Something Italian, and more broadly, European, companies should definitely learn from.</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:share:7375601074176434176",
  "published_at": "2025-09-22T06:30:19.530000",
  "images": [],
  "headline": "Job Hopping vs. Longevity: The Innovation Balancing Act",
  "description": "Explore how frequent job changes drive innovation and why some firms retain talent long-term. Learn from Big Tech's success and Europe's challenges."
}
