{
  "content": "<p>The other day I read a post from Mary Mellor Clark that really made me think.</p><p>&nbsp;</p><p>It asked a simple but powerful question:</p><p>&nbsp;</p><p>What if you were starting with AI from zero today?<br>Where should you start from?</p><p>&nbsp;</p><p>When GPT launched, I immediately knew it was a revolution in the making.<br>But honestly, it took me at least another year before I could really integrate it into my daily work and life (as a busy human ☺️)</p><p>&nbsp;</p><p>So if you’re a marketer starting from scratch with AI, here’s exactly what I’d do:</p><p>&nbsp;</p><p><br>1. Subscribe to GPT Plus ($20/month)</p><p>&nbsp;</p><p>2. Go to Settings > Personalisation, turn on all features.</p><p>&nbsp;</p><p>3. Activate and update all custom instructions.<br>Tell GPT who you are, what you do, and how you want to use it. Be specific.</p><p>&nbsp;</p><p>4. Start simple: edit some marketing copy.<br>Take a draft and ask GPT to turn it into a nice copy.<br>Make several tries (no magic wand here, just trial and error).</p><p>&nbsp;</p><p>5. Once you're happy with the results, use the final prompt to build your first Custom GPT to edit marketing copies.</p><p>&nbsp;</p><p>6. Once you’re comfortable building a custom GPT, build many more!<br>- One for images in a certain style.<br>- One for images in a different style.<br>- One for editing social media posts.<br>- One for editing blog posts.<br>- One for brainstorming marketing ideas.<br>...and more!</p><p>&nbsp;</p><p>You'll soon realise your custom GPTs will become part of your daily routine.</p><p>&nbsp;</p><p>7. Create projects.<br>Projects are essentially folders, ideal to organise your chats.<br>You can give custom instructions that apply to all chats inside a project.</p><p>&nbsp;</p><p>For example, Mary Mellor Clark wants to play around with vibe-coding websites and apps.<br>Create a project for each app you want to build.<br>Describe your project in the custom instructions before starting.</p><p>&nbsp;</p><p>8. Tell GPT you're a total beginner and let it guide you step by step.<br>From setting up GitHub to writing code etc.<br>Don't leave anything unsaid, ask as many questions as possible.</p><p>&nbsp;</p><p>9. Use the model o3 (limits apply).</p><p>&nbsp;</p><p>10. Once GPT has become part of your daily life, you can start exploring other Ai marketing tools like HeyGen, Runway and the majestic Google Veo3 ($250/month!!)</p><p>&nbsp;</p><p><br>Do you agree with these steps?</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:share:7341108919852818435",
  "published_at": "2025-06-19T06:30:14.774000",
  "images": [
    {
      "url": "https://raw.githubusercontent.com/GiacomoIono/linkedin-posts-clean/refs/heads/main/images/2025-06-19.jpg",
      "alt": ""
    }
  ]
}