{
  "content": "<p>This is how ChatGPT kills a small business.</p><p>&nbsp;</p><p>It is a real story, and a warning for every online marketer and business owner.</p><p>&nbsp;</p><p>Guide to Lofoten runs guided tours in the Lofoten Islands, northern Norway.</p><p>&nbsp;</p><p>For years, they nailed SEO and digital marketing.<br>They brought traffic to their website and sold their tours.</p><p>&nbsp;</p><p>Now, their business is collapsing before their eyes.</p><p>&nbsp;</p><p>Their revenue came 50/50 from:</p><p>&nbsp;</p><p>- Website content monetisation (display ads, paid articles etc)<br>- Guided tours</p><p>&nbsp;</p><p>The first half is gone.<br>GPT took their website traffic.</p><p>&nbsp;</p><p>Why visit a travel blog when a chatbot gives you the same answers instantly?</p><p>&nbsp;</p><p>The second half is dying too.<br>Their tours barely show up online anymore.</p><p>&nbsp;</p><p>💡 Because ChatGPT hardly mentions small websites for transactional conversations. There is growing academic evidence of this.</p><p>&nbsp;</p><p>It prefers popular platforms, like GetYourGuide in this case.</p><p>&nbsp;</p><p>Which take high commissions.<br>And that’s their small business' margin gone.</p><p>&nbsp;</p><p>Two possible ways out:</p><p>&nbsp;</p><p>1️⃣ Advertising<br>→ very expensive because competing against giants.</p><p>&nbsp;</p><p>2️⃣ Becoming famous content creators (300k+ followers?)<br>→ possible, but brutal in the crowded travel niche.</p><p>&nbsp;</p><p>No easy fix. Maybe no fix at all.<br>Their business model is simply becoming obsolete.</p><p>&nbsp;</p><p>And that happens. It always has during technological shifts.</p><p>&nbsp;</p><p>Bur for us marketers, two lessons stand out:</p><p>&nbsp;</p><p>1️⃣ Info businesses are dead.<br>2️⃣ Aggregators thrive in the age of AI.</p><p>&nbsp;</p><p>It's easy to see why.</p><p>&nbsp;</p><p>Aggregators provide a large source of organised structured data, perfect to feed AI algorithms.</p><p>&nbsp;</p><p>Of course, not all businesses are aggregators.<br>But they can look like one, or possibly work with one.</p><p>&nbsp;</p><p>Think of SEO structured data, or retail media.</p><p>&nbsp;</p><p>Adapt or die, as always.</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:ugcPost:7390815764590768128",
  "published_at": "2025-11-03T07:30:04.931000",
  "images": [
    {
      "url": "https://raw.githubusercontent.com/GiacomoIono/linkedin-posts-clean/refs/heads/main/images/2025-11-03_1.jpg",
      "alt": "Text: \"This is how ChatGPT is killing our small local business. When AI takes over. Guide to Lofoten."
    },
    {
      "url": "https://raw.githubusercontent.com/GiacomoIono/linkedin-posts-clean/refs/heads/main/images/2025-11-03_2.jpg",
      "alt": "Text explaining how ChatGPT's aggregator bias affects local Lofoten tour companies."
    },
    {
      "url": "https://raw.githubusercontent.com/GiacomoIono/linkedin-posts-clean/refs/heads/main/images/2025-11-03_3.jpg",
      "alt": "Text about business struggles due to AI and increased competition."
    }
  ],
  "headline": "How ChatGPT Crushed a Small Business: A Real Story",
  "description": "Discover how AI disrupted Guide to Lofoten's success and learn key lessons for digital marketers navigating the AI era."
}
