{
  "content": "<p>Last week I was in Shanghai,</p><p>&nbsp;</p><p>and I saw the future.</p><p>&nbsp;</p><p>What I expected:</p><p>&nbsp;</p><p>→ chaos and noise<br>→ grey skies and pollution<br>→ rubbish and smell</p><p>&nbsp;</p><p>What I found instead:</p><p>&nbsp;</p><p>→ quiet streets, even with heavy traffic<br>→ blue skies and crisp air<br>→ spotless roads, cleaner than Zurich</p><p>&nbsp;</p><p>The main reason?<br>Electric vehicles. ⚡️</p><p>&nbsp;</p><p>Nine out of ten cars are electric.<br>Nine out of ten brands you’ve probably never heard of.</p><p>&nbsp;</p><p>The reality of an electric-first city hits you head-on.</p><p>&nbsp;</p><p>This is what the future looks, sounds, and smells like.</p><p>&nbsp;</p><p>I don’t own an electric car myself, and I’ve always been a bit skeptical.</p><p>&nbsp;</p><p>But after Shanghai, I couldn’t have changed my mind faster!</p><p>&nbsp;</p><p>Electric cars aren’t just the future of mobility.<br>They’re the future of cities, and society itself.</p><p>&nbsp;</p><p>And the next logical step is autonomous driving.</p><p>&nbsp;</p><p>This will solve that percentage of drivers still driving like crazy and putting everyone in danger.</p><p>&nbsp;</p><p>This is going to be bigger than the smartphone or even AI.</p><p>&nbsp;</p><p>It’s going to reshape how we live, move, and breathe on this planet.</p><p>&nbsp;</p><p>For the first time in a while, I’m genuinely optimistic about the future and climate change.<br>It feels doable!</p><p>&nbsp;</p><p>Still, there are caveats.<br>A huge one: where the electricity comes from.<br>China still relies heavily on coal.</p><p>&nbsp;</p><p>But the more EVs take over, the stronger the incentive to invest in clean energy, even at a private level.</p><p>&nbsp;</p><p>Remember Elon Musk’s old plan for a fully solar-powered household?<br>Ahead of its time, but now it makes perfect sense.</p><p>&nbsp;</p><p>Another concern: the transition itself.<br>European car brands are under serious threat, along with countless jobs.</p><p>&nbsp;</p><p>Because Chinese cars are beautiful, powerful, and most importantly cheap.</p><p>&nbsp;</p><p>When I saw BMWs in Shanghai, they looked like relics of a smoky past.</p><p>&nbsp;</p><p>Meanwhile, Xiaomi looked like Ferrari.</p><p>&nbsp;</p><p>“Made in China” means innovation and quality at this point.</p><p>&nbsp;</p><p>(I even bought a replica of Timberland boots from a Chinese brand, that are just better and cheaper)</p><p>&nbsp;</p><p>I can’t wait for the electric future to arrive.</p><p>&nbsp;</p><p>But we’d better move fast to make it sustainable for our economies.</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:share:7388768293630787584",
  "published_at": "2025-10-28T07:30:27.404000",
  "images": []
}