{
  "content": "<p>Yesterday, I drove in the footsteps of James Bond at the Furka Pass.</p><p>&nbsp;</p><p>But something was deeply wrong.</p><p>&nbsp;</p><p>The massive glacier from the movie, the one behind the iconic Hotel Belvedere, was gone!</p><p>&nbsp;</p><p>Vanished in just 60 years.</p><p>&nbsp;</p><p>The hotel, built in the 1880s, was named \"Belvedere\" for its breathtaking view of that very glacier. Just few hundred meters away.</p><p>&nbsp;</p><p>Today, it overlooks a pile of rocks.<br>No wonder it's abandoned. 😔</p><p>&nbsp;</p><p>Climate change isn't just real. It's fast. Frighteningly fast.</p><p>&nbsp;</p><p>Forget the political debate for a moment and let's talk business.</p><p>&nbsp;</p><p>The next 2008-style financial crisis won't be triggered by an AI bubble.<br>(Spoiler: there is no AI bubble).</p><p>&nbsp;</p><p>👉 It will be triggered by climate change.</p><p>&nbsp;</p><p>Here's why:</p><p>&nbsp;</p><p>Extreme natural disasters have skyrocketed.<br>Some data shows a five-fold increase in 50 years. Other sources say two-fold in just the last 20.</p><p>&nbsp;</p><p>But here’s the problem nobody talks about:</p><p>&nbsp;</p><p>Natural disasters → $$$$ financial damage → $$$$ insurance claims.</p><p>&nbsp;</p><p>When claims get too high, insurers can't cover the losses.<br>So they simply stop insuring properties in high-risk areas.</p><p>&nbsp;</p><p>Provided they haven't bankrupted in the meantime.</p><p>&nbsp;</p><p>And then the domino effect:</p><p>&nbsp;</p><p>→ No insurance, no mortgage. Banks won't lend without insurance.<br>→ Property values plummet.<br>→ Massive wealth destruction.<br>→ Left without local business, banks close up branches and leave.</p><p>&nbsp;</p><p>A collapse in property prices and banks closing down is a horror movie we've all seen before.</p><p>&nbsp;</p><p>But this time, add catastrophic insurance losses to the mix.</p><p>&nbsp;</p><p>In all of this,<br>AI might be our only way out.</p><p>&nbsp;</p><p>Sophisticated reasoning models could find AND implement the solutions for us.</p><p>&nbsp;</p><p>Or at least, I hope that's what the 9-figure AI engineers are working on right now!</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:share:7348032694410207233",
  "published_at": "2025-07-13T06:30:02.247000",
  "images": [
    {
      "url": "https://raw.githubusercontent.com/GiacomoIono/linkedin-posts-clean/refs/heads/main/images/2025-07-13.jpg",
      "alt": ""
    }
  ]
}