{
  "content": "<p>While OpenAI flirts with erotic AI,</p><p>&nbsp;</p><p>Anthropic is quietly raking in billions from enterprise clients.</p><p>&nbsp;</p><p>The Claude’s maker is projected to hit $9 billion in revenue this year.</p><p>&nbsp;</p><p>Not far from OpenAI’s $13 billion, despite having just a fraction of its active users.</p><p>&nbsp;</p><p>In fact, Anthropic generates 80% of its revenue from around 300’000 enterprise customers.</p><p>&nbsp;</p><p>A far cry from the 800 million weekly active users of OpenAI, which are mostly consumers.</p><p>&nbsp;</p><p>Anthropic’s average revenue per user is off the charts! 🔥</p><p>&nbsp;</p><p>Same AI, very different monetisation models.</p><p>&nbsp;</p><p>In the end, both are backed by the same blend of Big Tech and VC money, so everyone will win regardless.</p><p>&nbsp;</p><p>But as an AI user and enthusiast myself, I can’t help but wonder which model will actually prevail.</p><p>&nbsp;</p><p>If I had to place a bet, I’d still go with ChatGPT + ads.</p><p>&nbsp;</p><p>Because I still believe GPT is a new Google, plus social, plus personal companion.</p><p>&nbsp;</p><p>Sure, enterprise AI is more profitable now, but also more niche in the long term.</p><p>&nbsp;</p><p>And anyway more competitive.</p><p>&nbsp;</p><p>Think of competitors like Google Cloud or AWS with their respective enterprise AI offerings.</p><p>&nbsp;</p><p>But wait, Google and Amazon are also among the largest Anthropic’s shareholders 😅</p><p>&nbsp;</p><p>In any case, what’s already clear now is that models will commoditise, both in B2B and B2C.</p><p>&nbsp;</p><p>What matters is the ecosystem built around them.</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:share:7388964409928294402",
  "published_at": "2025-10-29T07:30:06.263000",
  "images": [],
  "headline": "OpenAI vs Anthropic: Who's Winning the AI Revenue Race?",
  "description": "OpenAI's consumer reach vs Anthropic's enterprise gains: exploring the AI giants' revenue strategies and what the future holds for these tech titans."
}
