{
  "content": "<p>Tomorrow, the world of e-commerce and online marketing will be turned upside down.</p><p>&nbsp;</p><p>What’s happening tomorrow:</p><p>&nbsp;</p><p>The U.S. is revoking the de minimis regime.</p><p>&nbsp;</p><p>For years, any imported parcel under $800 was exempt from tariffs and custom duties.</p><p>&nbsp;</p><p>Chinese giants like Temu and Shein built their empires on this loophole.<br>They send their parcels directly from China into the US, each one usually under $800 given their extremely low prices.</p><p>&nbsp;</p><p>De minimis is actually common practice in several countries, but the US has the highest threshold. For comparison, the Uk applies a de minimis of just £135.</p><p>&nbsp;</p><p>From tomorrow this will change.<br>No more de minimis in the US.</p><p>&nbsp;</p><p>Temu and Shein will be subject to custom duties and tariffs like anybody else.</p><p>&nbsp;</p><p>And now tariffs are over 100%!</p><p>&nbsp;</p><p>The effects are already visible.<br>Shein prices in the US are up by over 10% in just a few days.</p><p>&nbsp;</p><p>Also, several reports indicate how Shein and Temu already retreated from Google Ads and performance marketing, dropping massively their App Store ranking.</p><p>&nbsp;</p><p>This is a seismic shift in the industry!</p><p>&nbsp;</p><p>Suddenly, American retailers will have much less competition.</p><p>&nbsp;</p><p>At the same time, inflation-sensitive consumers will have to look somewhere else for cheap products. Will they switch to more expensive American products?</p><p>&nbsp;</p><p>Let’s not forget, tariffs apply to everyone, Amazon included, which still imports bulk of its inventory from Chinese suppliers.</p><p>&nbsp;</p><p><br>Interesting times to be in e-commerce!</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:ugcPost:7323629461306843138",
  "published_at": "2025-05-01T10:48:50.316000",
  "images": [
    {
      "url": "https://raw.githubusercontent.com/GiacomoIono/linkedin-posts-clean/refs/heads/main/images/2025-05-01_1.jpg",
      "alt": ""
    },
    {
      "url": "https://raw.githubusercontent.com/GiacomoIono/linkedin-posts-clean/refs/heads/main/images/2025-05-01_2.jpg",
      "alt": ""
    }
  ]
}