{
  "content": "<p>Google Search is in free fall.</p><p>&nbsp;</p><p>Market share keeps declining in Europe 👇 </p><p>&nbsp;</p><p>AI Mode is a last-ditch attempt to bring back users who inevitably moved to Ai chatbots.</p><p>&nbsp;</p><p>But it'll be a tough endeavour.</p><p>&nbsp;</p><p>It's not just about delivering better Ai answers.<br>It's about acknowledging a fundamental shift in user behaviour.</p><p>&nbsp;</p><p>We're moving from a 30-year old keyword-based search experience to a conversational one.</p><p>&nbsp;</p><p>In this new world, ChatGPT and Perplexity are the clear leaders.</p><p>&nbsp;</p><p>They're winning not because they give better answers than Google (they probably don’t), but because users treat them like confidants instead of tools.</p><p>&nbsp;</p><p>It's not just brand loyalty. It’s intimacy.</p><p>&nbsp;</p><p><br>Was watching a news segment where Italian teens were asked if they’d turn to their parents to talk about emotional issues.</p><p>&nbsp;</p><p>Most said no.<br>When asked who they do talk to then, many answered ChatGPT! 😳</p><p>&nbsp;</p><p>Ai chatbots have become life companions, who know us better than anyone else. Yes, even better than Google or Meta at this point! </p><p>&nbsp;</p><p>Switching to a new Ai companion is like breaking up with our partner.<br>Many will simply stick to GPT and never go back to Google. Full stop.</p><p>&nbsp;</p><p><br>The cherry on top,<br>both GPT and Perplexity have launched a Google Shopping clone, targeting the most valuable internet users, those who are ready to make a purchase.</p><p>&nbsp;</p><p>This is a direct attack at Google's most valuable revenue stream!</p><p>&nbsp;</p><p>I tried GPT Shopping and I genuinely find it better than Google Shopping.</p><p>&nbsp;</p><p><br>Only time will tell who the winner will be.</p><p>&nbsp;</p><p>But one thing is clear:<br>For the first time in 30 years, the rules of the internet are being rewritten.</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:share:7332828894745571329",
  "published_at": "2025-05-27T08:30:11.905000",
  "images": [
    {
      "url": "https://raw.githubusercontent.com/GiacomoIono/linkedin-posts-clean/refs/heads/main/images/2025-05-27.jpg",
      "alt": ""
    }
  ]
}