{
  "content": "<p>Is the advertising duopoly cracking? 📉<br>In 2019, Google and Meta controlled over 50% of the US online ads market. Today that dominance is eroding.</p><p>&nbsp;</p><p>Who is taking their place?<br>Mostly Amazon.<br>But also TikTok, Walmart, Pinterest, streaming giants like Netflix.</p><p>&nbsp;</p><p>And... Spotify, Reddit, Snap, the list goes on.</p><p>&nbsp;</p><p>ChatGPT ads will soon join the ranks too.</p><p>&nbsp;</p><p>As if AI wasn't disrupting marketing enough, now we have to juggle extreme media fragmentation.</p><p>&nbsp;</p><p>And this is a new reality for \"young\" marketers like me (<40 😅).</p><p>&nbsp;</p><p>My media budget spreadsheet went from just a few rows in 2016 to thousands of lines in 2025. No joke!</p><p>&nbsp;</p><p>Trying to do marketing today like we did 10 years ago isn't just outdated.<br>It is insanity!</p><p>&nbsp;</p><p>But what does this fragmentation mean in practice?</p><p>&nbsp;</p><p>1. Specialisation is not enough.<br>Brands cannot afford to hire just a \"Google Ads Specialist.\" They need marketers who can navigate every platform, because a new one might pop up tomorrow. The era of the full-stack marketer is here!</p><p>&nbsp;</p><p>2. Measurement is a war zone.<br>Which ad network is delivering the best ROI? Good luck answering that!</p><p>&nbsp;</p><p>3. Streamline streamline.<br>The most valuable assets will be SaaS tools or agencies that enable a bird's-eye view of media buying across all channels. So far I haven't found any, but I'm sure they'll come.</p><p>&nbsp;</p><p>We are in the midst of a whole new marketing revolution.<br>Better getting ready now!</p><p>&nbsp;</p><p><br>---<br>If you found this post useful, give it a 👍 and reshare it to your network!<br>It helps me keep going and share more marketing insights like this.</p><p>&nbsp;</p>",
  "url": "https://www.linkedin.com/feed/update/urn:li:ugcPost:7404565714969464832",
  "published_at": "2025-12-10T17:00:36.940000",
  "images": [
    {
      "url": "https://raw.githubusercontent.com/GiacomoIono/linkedin-posts-clean/refs/heads/main/images/2025-12-10.jpg",
      "alt": ""
    }
  ]
}